app/views/users/show.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ?  ORDER BY "posts"."id" ASC LIMIT 1  [["user_id", 1]]
---
<h3>Posts</h3>
<% @user.posts.reverse.each do |msg| %>

SELECT "groups".* FROM "groups" INNER JOIN "group_permissions" ON "groups"."id" = "group_permissions"."group_id" WHERE "group_permissions"."user_id" = ?  [["user_id", 1]]
---
<h3>Groups</h3>
<% @user.groups.each do |group| %>